In [47]:
# Student data load 

import pandas as pd

In [48]:
record = pd.read_csv('studentgrade.csv')

record.head()

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence
0,1913357,"Behal, Harry",90,13.0,12.0,NaN
1,1899502,"Chugh, Gursahib Singh",67,7.0,6.0,22.0
2,1895342,"Davinder Singh, Davinder Singh",70,28.0,14.0,12.0
3,1913546,"Devarapu, Mary Keerthi",60,7.0,16.0,16.0
4,1895179,"Dharam, Naresh",55,16.0,5.0,38.0

In [49]:
record.describe()

                 ID     Grades  ConsultationsD1  ConsultationsD2  Hrabsence
count  3.400000e+01  34.000000        33.000000        32.000000  31.000000
mean   1.909819e+06  58.470588         9.454545        10.781250  21.046774
std    7.240526e+03  24.096064         6.694638         5.933689  13.605801
min    1.895123e+06   0.000000         1.000000         1.000000   4.000000
25%    1.913046e+06  48.250000         6.000000         6.000000  12.000000
50%    1.913451e+06  65.500000         9.000000         9.000000  20.000000
75%    1.913574e+06  74.750000        12.000000        16.000000  30.000000
max    1.913599e+06  90.000000        28.000000        25.000000  56.000000

In [50]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 6 columns):
ID                 34 non-null int64
Name               34 non-null object
Grades             34 non-null int64
ConsultationsD1    33 non-null float64
ConsultationsD2    32 non-null float64
Hrabsence          31 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 1.7+ KB

In [51]:
record.dtypes

ID                   int64
Name                object
Grades               int64
ConsultationsD1    float64
ConsultationsD2    float64
Hrabsence          float64
dtype: object

In [52]:
record.Hrabsence.unique()

array([  nan, 22.  , 12.  , 16.  , 38.  ,  8.  , 20.  , 14.  , 32.  ,
       17.45, 30.  ,  4.  , 56.  ,  6.  , 13.  , 26.  ])

In [56]:
#  Replacing nan (null value with mean value)

record.Hrabsence.fillna(round(record.Hrabsence.mean()), inplace=True)

In [58]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 6 columns):
ID                 34 non-null int64
Name               34 non-null object
Grades             34 non-null int64
ConsultationsD1    33 non-null float64
ConsultationsD2    32 non-null float64
Hrabsence          34 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 1.7+ KB

In [45]:
record.dtypes

ID                   int64
Name                object
Grades               int64
ConsultationsD1    float64
ConsultationsD2    float64
Hrabsence          float64
dtype: object

In [57]:
record.Hrabsence.unique()

array([21.  , 22.  , 12.  , 16.  , 38.  ,  8.  , 20.  , 14.  , 32.  ,
       17.45, 30.  ,  4.  , 56.  ,  6.  , 13.  , 26.  ])

In [60]:
record.ConsultationsD1.unique()

array([13.,  7., 28., 16.,  8., 10.,  6., 12.,  1.,  9.,  2., 25., 11.,
        4., 24., nan])

In [ ]:
# Replacing nan value with mean

In [61]:
record.ConsultationsD2.unique()

array([12.,  6., 14., 16.,  5.,  9.,  8., 13.,  1.,  7., 17., 25., 19.,
       nan, 24., 10.])

In [ ]:
# Replacing nan value with mean